:PROPERTIES:
:ID:       BCCB2670-F426-477F-931B-6535659836C8
:END:
#+TITLE: RFC 022: Registering the Production Domain for RepoLens
#+AUTHOR: Meta AI (AI Assistant)
#+DATE: [2024-09-14 Sat]

** Domain Options and Prioritization

We have identified and prioritized the following domain options:

1. repolens.dev (Highest Priority)
2. repolens.io
3. repolens.app
4. repolens.net
5. repolens.link (Lowest Priority)

Let's check the availability and current configuration of each domain using dig:

#+BEGIN_SRC shell :results output :exports both
for domain in repolens.dev repolens.io repolens.app repolens.net repolens.link; do
  echo "Checking $domain:"
  dig +short $domain A
  dig +short $domain AAAA
  echo "---"
done
#+END_SRC

#+RESULTS:
#+begin_example
Checking repolens.dev:
---
Checking repolens.io:
---
Checking repolens.app:
---
Checking repolens.net:
---
Checking repolens.link:
---
#+end_example

Based on these results, it appears that none of these domains are currently registered or configured with A or AAAA records. This suggests that all of these domain options are likely available for registration.

Recommendation:
We recommend proceeding with registering repolens.dev for the following reasons:
1. The .dev TLD is specifically designed for developer-focused projects and tools.
2. It has a strong association with development and technology, which aligns well with RepoLens' purpose.
3. Google manages the .dev TLD, which requires HTTPS by default, enhancing security.

** Initial Domain Availability Check

#+BEGIN_SRC shell :tangle check_domain_availability.sh
#!/bin/bash
DOMAIN="repolens.dev"

if host $DOMAIN &> /dev/null; then
    echo "The domain ${DOMAIN} is already registered."
else
    echo "The domain ${DOMAIN} appears to be available."
fi
#+END_SRC

#+RESULTS:
: The domain repolens.dev appears to be available.

